# FamilyAlwaysVertical Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyAlwaysVertical Property
ParameterTypeId Class See Also
---
"Always vertical"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyAlwaysVertical { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyAlwaysVertical As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyAlwaysVertical {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace